# Toposolid Get Sub Division Ids Method

Source: https://www.revitapidocs.com/2026/0a8cf5c3-61c8-b255-06e7-bb42a9097788.htm

---

| Toposolid Get Sub Division Ids Method |
| --- |

Gets all element ids of Toposolid subdivisions with the current Toposolid as its host.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<ElementId> GetSubDivisionIds()
```

```
Public Function GetSubDivisionIds As IList(Of ElementId)
```

```
public:
IList<ElementId^>^ GetSubDivisionIds()
```

```
member GetSubDivisionIds : unit -> IList<ElementId>
```

#### Return Value

IList ElementId
The array of Toposolid subdivision ids. See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace